{"471": {"trial_id": "471", "val_loss": 0.37503761053085327, "val_accuracy": 0.9599999785423279, "model_config": {"name": "model_471", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_472"}, "registered_name": null, "name": "input_472", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_471", "trainable": true, "dtype": "float32", "factor": [-0.09358674793575944, 0.09358674793575944], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_471", "inbound_nodes": [[["input_472", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_471", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_471", "inbound_nodes": [[["random_brightness_471", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_471", "trainable": true, "dtype": "float32", "height_factor": 0.14339174705071167, "width_factor": 0.14339174705071167, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_471", "inbound_nodes": [[["random_flip_471", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_471", "trainable": true, "dtype": "float32", "stddev": 0.013567027573716518, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_471", "inbound_nodes": [[["random_translation_471", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_971", "trainable": true, "dtype": "float32", "kernel_size": [8, 8], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "depthwise_conv2d_971", "inbound_nodes": [[["gaussian_noise_471", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1731", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_1731", "inbound_nodes": [[["depthwise_conv2d_971", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_760", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 249, 249, 3]}, "name": "conv2d_760", "inbound_nodes": [[["activation_1731", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1732", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_1732", "inbound_nodes": [[["conv2d_760", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_972", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 246, 246, 12]}, "name": "depthwise_conv2d_972", "inbound_nodes": [[["activation_1732", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1733", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_1733", "inbound_nodes": [[["depthwise_conv2d_972", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_973", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 242, 242, 12]}, "name": "depthwise_conv2d_973", "inbound_nodes": [[["activation_1733", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1734", "trainable": true, "dtype": "float32", "activation": "tanh"}, "registered_name": null, "name": "activation_1734", "inbound_nodes": [[["depthwise_conv2d_973", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_471", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_471", "inbound_nodes": [[["activation_1734", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_471", "trainable": true, "dtype": "float32", "rate": 0.33955240233390266, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 155952]}, "name": "dropout_471", "inbound_nodes": [[["flatten_471", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_471", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 155952]}, "name": "dense_471", "inbound_nodes": [[["dropout_471", 0, 0, {}]]]}], "input_layers": [["input_472", 0, 0]], "output_layers": [["dense_471", 0, 0]]}}, "204": {"trial_id": "204", "val_loss": 0.3746570348739624, "val_accuracy": 0.8600000143051147, "model_config": {"name": "model_204", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_205"}, "registered_name": null, "name": "input_205", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_204", "trainable": true, "dtype": "float32", "factor": [-0.05657395102237284, 0.05657395102237284], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_204", "inbound_nodes": [[["input_205", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_204", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_204", "inbound_nodes": [[["random_brightness_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_204", "trainable": true, "dtype": "float32", "height_factor": 0.16154768440364312, "width_factor": 0.16154768440364312, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_204", "inbound_nodes": [[["random_flip_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_204", "trainable": true, "dtype": "float32", "stddev": 0.0043496850489799475, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_204", "inbound_nodes": [[["random_translation_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_344", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "depthwise_conv2d_344", "inbound_nodes": [[["gaussian_noise_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_715", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_715", "inbound_nodes": [[["depthwise_conv2d_344", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_371", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 126, 126, 3]}, "name": "conv2d_371", "inbound_nodes": [[["activation_715", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_716", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_716", "inbound_nodes": [[["conv2d_371", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_345", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 123, 123, 24]}, "name": "depthwise_conv2d_345", "inbound_nodes": [[["activation_716", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_717", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_717", "inbound_nodes": [[["depthwise_conv2d_345", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_346", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [3, 3], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 119, 119, 24]}, "name": "depthwise_conv2d_346", "inbound_nodes": [[["activation_717", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_718", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_718", "inbound_nodes": [[["depthwise_conv2d_346", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_204", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_204", "inbound_nodes": [[["activation_718", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_204", "trainable": true, "dtype": "float32", "rate": 0.4982364254528209, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 29400]}, "name": "dropout_204", "inbound_nodes": [[["flatten_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_204", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 29400]}, "name": "dense_204", "inbound_nodes": [[["dropout_204", 0, 0, {}]]]}], "input_layers": [["input_205", 0, 0]], "output_layers": [["dense_204", 0, 0]]}}, "250": {"trial_id": "250", "val_loss": 0.4215847849845886, "val_accuracy": 0.9200000166893005, "model_config": {"name": "model_250", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_251"}, "registered_name": null, "name": "input_251", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_250", "trainable": true, "dtype": "float32", "factor": [-0.05854881499108806, 0.05854881499108806], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_250", "inbound_nodes": [[["input_251", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_250", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_250", "inbound_nodes": [[["random_brightness_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_250", "trainable": true, "dtype": "float32", "height_factor": 0.14905966220293249, "width_factor": 0.14905966220293249, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_250", "inbound_nodes": [[["random_flip_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_250", "trainable": true, "dtype": "float32", "stddev": 0.006572656948664235, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_250", "inbound_nodes": [[["random_translation_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_473", "trainable": true, "dtype": "float32", "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "depthwise_conv2d_473", "inbound_nodes": [[["gaussian_noise_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_894", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_894", "inbound_nodes": [[["depthwise_conv2d_473", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_421", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [4, 4], "strides": [3, 3], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 127, 3]}, "name": "conv2d_421", "inbound_nodes": [[["activation_894", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_895", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_895", "inbound_nodes": [[["conv2d_421", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_474", "trainable": true, "dtype": "float32", "kernel_size": [8, 8], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 42, 42, 20]}, "name": "depthwise_conv2d_474", "inbound_nodes": [[["activation_895", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_896", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_896", "inbound_nodes": [[["depthwise_conv2d_474", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_475", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 20]}, "name": "depthwise_conv2d_475", "inbound_nodes": [[["activation_896", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_897", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_897", "inbound_nodes": [[["depthwise_conv2d_475", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_250", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_250", "inbound_nodes": [[["activation_897", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_250", "trainable": true, "dtype": "float32", "rate": 0.5284667869896725, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 2000]}, "name": "dropout_250", "inbound_nodes": [[["flatten_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_250", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 2000]}, "name": "dense_250", "inbound_nodes": [[["dropout_250", 0, 0, {}]]]}], "input_layers": [["input_251", 0, 0]], "output_layers": [["dense_250", 0, 0]]}}, "452": {"trial_id": "452", "val_loss": 0.8835867047309875, "val_accuracy": 0.5799999833106995, "model_config": {"name": "model_452", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_453"}, "registered_name": null, "name": "input_453", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_452", "trainable": true, "dtype": "float32", "factor": [-0.06983930172530058, 0.06983930172530058], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_452", "inbound_nodes": [[["input_453", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_452", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_452", "inbound_nodes": [[["random_brightness_452", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_452", "trainable": true, "dtype": "float32", "height_factor": 0.15703295705029902, "width_factor": 0.15703295705029902, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_452", "inbound_nodes": [[["random_flip_452", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_452", "trainable": true, "dtype": "float32", "stddev": 1.2916359159309901e-05, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_452", "inbound_nodes": [[["random_translation_452", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_921", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "depthwise_conv2d_921", "inbound_nodes": [[["gaussian_noise_452", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1660", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_1660", "inbound_nodes": [[["depthwise_conv2d_921", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_739", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [8, 8], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 254, 254, 3]}, "name": "conv2d_739", "inbound_nodes": [[["activation_1660", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1661", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_1661", "inbound_nodes": [[["conv2d_739", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_740", "trainable": true, "dtype": "float32", "filters": 28, "kernel_size": [8, 8], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 247, 247, 20]}, "name": "conv2d_740", "inbound_nodes": [[["activation_1661", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1662", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_1662", "inbound_nodes": [[["conv2d_740", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_922", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 240, 240, 28]}, "name": "depthwise_conv2d_922", "inbound_nodes": [[["activation_1662", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1663", "trainable": true, "dtype": "float32", "activation": "tanh"}, "registered_name": null, "name": "activation_1663", "inbound_nodes": [[["depthwise_conv2d_922", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_452", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_452", "inbound_nodes": [[["activation_1663", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_452", "trainable": true, "dtype": "float32", "rate": 0.5408140335708768, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 357532]}, "name": "dropout_452", "inbound_nodes": [[["flatten_452", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_452", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 357532]}, "name": "dense_452", "inbound_nodes": [[["dropout_452", 0, 0, {}]]]}], "input_layers": [["input_453", 0, 0]], "output_layers": [["dense_452", 0, 0]]}}, "158": {"trial_id": "158", "val_loss": 0.1884952038526535, "val_accuracy": 0.9599999785423279, "model_config": {"name": "model_158", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_159"}, "registered_name": null, "name": "input_159", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_158", "trainable": true, "dtype": "float32", "factor": [-0.06624781714769025, 0.06624781714769025], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_158", "inbound_nodes": [[["input_159", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_158", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_158", "inbound_nodes": [[["random_brightness_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_158", "trainable": true, "dtype": "float32", "height_factor": 0.15402577580469295, "width_factor": 0.15402577580469295, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_158", "inbound_nodes": [[["random_flip_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_158", "trainable": true, "dtype": "float32", "stddev": 0.008213936388386193, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_158", "inbound_nodes": [[["random_translation_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_208", "trainable": true, "dtype": "float32", "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "depthwise_conv2d_208", "inbound_nodes": [[["gaussian_noise_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_533", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_533", "inbound_nodes": [[["depthwise_conv2d_208", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_325", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 127, 3]}, "name": "conv2d_325", "inbound_nodes": [[["activation_533", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_534", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_534", "inbound_nodes": [[["conv2d_325", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_209", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 124, 124, 24]}, "name": "depthwise_conv2d_209", "inbound_nodes": [[["activation_534", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_535", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_535", "inbound_nodes": [[["depthwise_conv2d_209", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_210", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [3, 3], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 120, 120, 24]}, "name": "depthwise_conv2d_210", "inbound_nodes": [[["activation_535", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_536", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_536", "inbound_nodes": [[["depthwise_conv2d_210", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_158", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_158", "inbound_nodes": [[["activation_536", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_158", "trainable": true, "dtype": "float32", "rate": 0.533614088192617, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 29400]}, "name": "dropout_158", "inbound_nodes": [[["flatten_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_158", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 29400]}, "name": "dense_158", "inbound_nodes": [[["dropout_158", 0, 0, {}]]]}], "input_layers": [["input_159", 0, 0]], "output_layers": [["dense_158", 0, 0]]}}, "34": {"trial_id": "34", "val_loss": 0.6796706318855286, "val_accuracy": 0.7599999904632568, "model_config": {"name": "model_34", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_35"}, "registered_name": null, "name": "input_35", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_34", "trainable": true, "dtype": "float32", "factor": [-0.19794874052178849, 0.19794874052178849], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_34", "inbound_nodes": [[["input_35", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_34", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_34", "inbound_nodes": [[["random_brightness_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_34", "trainable": true, "dtype": "float32", "height_factor": 0.18445295660066563, "width_factor": 0.18445295660066563, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_34", "inbound_nodes": [[["random_flip_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_34", "trainable": true, "dtype": "float32", "stddev": 0.04396350047434399, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_34", "inbound_nodes": [[["random_translation_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_61", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "conv2d_61", "inbound_nodes": [[["gaussian_noise_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_81", "trainable": true, "dtype": "float32", "activation": "tanh"}, "registered_name": null, "name": "activation_81", "inbound_nodes": [[["conv2d_61", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_62", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 16]}, "name": "conv2d_62", "inbound_nodes": [[["activation_81", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_82", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_82", "inbound_nodes": [[["conv2d_62", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_20", "trainable": true, "dtype": "float32", "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 64, 24]}, "name": "depthwise_conv2d_20", "inbound_nodes": [[["activation_82", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_83", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_83", "inbound_nodes": [[["depthwise_conv2d_20", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_63", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [4, 4], "strides": [3, 3], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 31, 31, 24]}, "name": "conv2d_63", "inbound_nodes": [[["activation_83", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_84", "trainable": true, "dtype": "float32", "activation": "tanh"}, "registered_name": null, "name": "activation_84", "inbound_nodes": [[["conv2d_63", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_34", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_34", "inbound_nodes": [[["activation_84", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_34", "trainable": true, "dtype": "float32", "rate": 0.3711636146807528, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 1200]}, "name": "dropout_34", "inbound_nodes": [[["flatten_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1200]}, "name": "dense_34", "inbound_nodes": [[["dropout_34", 0, 0, {}]]]}], "input_layers": [["input_35", 0, 0]], "output_layers": [["dense_34", 0, 0]]}}, "138": {"trial_id": "138", "val_loss": 0.46160566806793213, "val_accuracy": 0.8799999952316284, "model_config": {"name": "model_138", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_139"}, "registered_name": null, "name": "input_139", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_138", "trainable": true, "dtype": "float32", "factor": [-0.027292930223059675, 0.027292930223059675], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_138", "inbound_nodes": [[["input_139", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_138", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_138", "inbound_nodes": [[["random_brightness_138", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_138", "trainable": true, "dtype": "float32", "height_factor": 0.15842707775130538, "width_factor": 0.15842707775130538, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_138", "inbound_nodes": [[["random_flip_138", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_138", "trainable": true, "dtype": "float32", "stddev": 0.034109476198514635, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_138", "inbound_nodes": [[["random_translation_138", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_166", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": 