{"204": {"trial_id": "204", "val_loss": 0.04010000079870224, "val_accuracy": 1.0, "model_config": {"name": "model_204", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_205"}, "registered_name": null, "name": "input_205", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_204", "trainable": true, "dtype": "float32", "factor": [-0.06085566637386435, 0.06085566637386435], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_204", "inbound_nodes": [[["input_205", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_204", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_204", "inbound_nodes": [[["random_brightness_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_204", "trainable": true, "dtype": "float32", "height_factor": 0.018099747726754423, "width_factor": 0.018099747726754423, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_204", "inbound_nodes": [[["random_flip_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_204", "trainable": true, "dtype": "float32", "stddev": 0.003911737763491749, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_204", "inbound_nodes": [[["random_translation_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_480", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "conv2d_480", "inbound_nodes": [[["gaussian_noise_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_599", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_599", "inbound_nodes": [[["conv2d_480", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_481", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 127, 8]}, "name": "conv2d_481", "inbound_nodes": [[["activation_599", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_600", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_600", "inbound_nodes": [[["conv2d_481", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_482", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [8, 8], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 124, 124, 16]}, "name": "conv2d_482", "inbound_nodes": [[["activation_600", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_601", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_601", "inbound_nodes": [[["conv2d_482", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_119", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 117, 117, 24]}, "name": "depthwise_conv2d_119", "inbound_nodes": [[["activation_601", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_602", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_602", "inbound_nodes": [[["depthwise_conv2d_119", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_204", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_204", "inbound_nodes": [[["activation_602", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_204", "trainable": true, "dtype": "float32", "rate": 0.5056339834835645, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 16224]}, "name": "dropout_204", "inbound_nodes": [[["flatten_204", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_204", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16224]}, "name": "dense_204", "inbound_nodes": [[["dropout_204", 0, 0, {}]]]}], "input_layers": [["input_205", 0, 0]], "output_layers": [["dense_204", 0, 0]]}}, "250": {"trial_id": "250", "val_loss": 0.3481079041957855, "val_accuracy": 0.8999999761581421, "model_config": {"name": "model_250", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_251"}, "registered_name": null, "name": "input_251", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_250", "trainable": true, "dtype": "float32", "factor": [-0.0002830683446798825, 0.0002830683446798825], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_250", "inbound_nodes": [[["input_251", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_250", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_250", "inbound_nodes": [[["random_brightness_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_250", "trainable": true, "dtype": "float32", "height_factor": 0.000766985416069987, "width_factor": 0.000766985416069987, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_250", "inbound_nodes": [[["random_flip_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_250", "trainable": true, "dtype": "float32", "stddev": 0.018944407280985082, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_250", "inbound_nodes": [[["random_translation_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_620", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "conv2d_620", "inbound_nodes": [[["gaussian_noise_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_780", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_780", "inbound_nodes": [[["conv2d_620", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_621", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 127, 8]}, "name": "conv2d_621", "inbound_nodes": [[["activation_780", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_781", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_781", "inbound_nodes": [[["conv2d_621", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_622", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [3, 3], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 124, 124, 16]}, "name": "conv2d_622", "inbound_nodes": [[["activation_781", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_782", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_782", "inbound_nodes": [[["conv2d_622", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_160", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 42, 42, 8]}, "name": "depthwise_conv2d_160", "inbound_nodes": [[["activation_782", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_783", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_783", "inbound_nodes": [[["depthwise_conv2d_160", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_250", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_250", "inbound_nodes": [[["activation_783", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_250", "trainable": true, "dtype": "float32", "rate": 0.4020328423943876, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 392]}, "name": "dropout_250", "inbound_nodes": [[["flatten_250", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_250", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 392]}, "name": "dense_250", "inbound_nodes": [[["dropout_250", 0, 0, {}]]]}], "input_layers": [["input_251", 0, 0]], "output_layers": [["dense_250", 0, 0]]}}, "158": {"trial_id": "158", "val_loss": 0.6171060800552368, "val_accuracy": 0.800000011920929, "model_config": {"name": "model_158", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_159"}, "registered_name": null, "name": "input_159", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_158", "trainable": true, "dtype": "float32", "factor": [-0.08032213940543147, 0.08032213940543147], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_158", "inbound_nodes": [[["input_159", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_158", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_158", "inbound_nodes": [[["random_brightness_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_158", "trainable": true, "dtype": "float32", "height_factor": 0.05130512514303894, "width_factor": 0.05130512514303894, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_158", "inbound_nodes": [[["random_flip_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_158", "trainable": true, "dtype": "float32", "stddev": 0.03406157931650495, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_158", "inbound_nodes": [[["random_translation_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_355", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [6, 6], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "conv2d_355", "inbound_nodes": [[["gaussian_noise_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_434", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_434", "inbound_nodes": [[["conv2d_355", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_356", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [4, 4], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 43, 43, 4]}, "name": "conv2d_356", "inbound_nodes": [[["activation_434", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_435", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_435", "inbound_nodes": [[["conv2d_356", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_158", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_158", "inbound_nodes": [[["activation_435", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_158", "trainable": true, "dtype": "float32", "rate": 0.5015523104328664, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 2400]}, "name": "dropout_158", "inbound_nodes": [[["flatten_158", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_158", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 2400]}, "name": "dense_158", "inbound_nodes": [[["dropout_158", 0, 0, {}]]]}], "input_layers": [["input_159", 0, 0]], "output_layers": [["dense_158", 0, 0]]}}, "34": {"trial_id": "34", "val_loss": 0.6570436358451843, "val_accuracy": 0.7400000095367432, "model_config": {"name": "model_34", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_35"}, "registered_name": null, "name": "input_35", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_34", "trainable": true, "dtype": "float32", "factor": [-0.11276690665080889, 0.11276690665080889], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_34", "inbound_nodes": [[["input_35", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_34", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_34", "inbound_nodes": [[["random_brightness_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_34", "trainable": true, "dtype": "float32", "height_factor": 0.057469672824036026, "width_factor": 0.057469672824036026, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_34", "inbound_nodes": [[["random_flip_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_34", "trainable": true, "dtype": "float32", "stddev": 0.11001608547979887, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_34", "inbound_nodes": [[["random_translation_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_81", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [8, 8], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "conv2d_81", "inbound_nodes": [[["gaussian_noise_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_109", "trainable": true, "dtype": "float32", "activation": "tanh"}, "registered_name": null, "name": "activation_109", "inbound_nodes": [[["conv2d_81", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_82", "trainable": true, "dtype": "float32", "filters": 28, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 20]}, "name": "conv2d_82", "inbound_nodes": [[["activation_109", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_110", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_110", "inbound_nodes": [[["conv2d_82", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_28", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 28]}, "name": "depthwise_conv2d_28", "inbound_nodes": [[["activation_110", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_111", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_111", "inbound_nodes": [[["depthwise_conv2d_28", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_29", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 121, 121, 28]}, "name": "depthwise_conv2d_29", "inbound_nodes": [[["activation_111", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_112", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_112", "inbound_nodes": [[["depthwise_conv2d_29", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_34", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_34", "inbound_nodes": [[["activation_112", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_34", "trainable": true, "dtype": "float32", "rate": 0.4215617355871567, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 20412]}, "name": "dropout_34", "inbound_nodes": [[["flatten_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 20412]}, "name": "dense_34", "inbound_nodes": [[["dropout_34", 0, 0, {}]]]}], "input_layers": [["input_35", 0, 0]], "output_layers": [["dense_34", 0, 0]]}}, "138": {"trial_id": "138", "val_loss": 0.7385061383247375, "val_accuracy": 0.800000011920929, "model_config": {"name": "model_138", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_139"}, "registered_name": null, "name": "input_139", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_138", "trainable": true, "dtype": "float32", "factor": [-0.0850628967561995, 0.0850628967561995], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_138", "inbound_nodes": [[["input_139", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_138", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_138", "inbound_nodes": [[["random_brightness_138", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_138", "trainable": true, "dtype": "float32", "height_factor": 0.020377119622310518, "width_factor": 0.020377119622310518, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_138", "inbound_nodes": [[["random_flip_138", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_138", "trainable": true, "dtype": "float32", "stddev": 0.028048646834295955, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_138", "inbound_nodes": [[["random_translation_138", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_311", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [8, 8], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "conv2d_311", "inbound_nodes": [[["gaussian_noise_138", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_386", "trainable": true, "dtype": "float32", "activation": "tanh"}, "registered_name": null, "name": "activation_386", "inbound_nodes": [[["conv2d_311", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_312", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [4, 4], "strides": [7, 7], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 249, 249, 8]}, "name": "conv2d_312", "inbound_nodes": [[["activation_386", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_387", "trainable": true, "dtype": "float32", "activation": "tanh"}, "registered_name": null, "name": "activation_387", "inbound_nodes": [[["conv2d_312", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_138", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_138", "inbound_nodes": [[["activation_387", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_138", "trainable": true, "dtype": "float32", "rate": 0.5188389169468847, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 10368]}, "name": "dropout_138", "inbound_nodes": [[["flatten_138", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_138", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 10368]}, "name": "dense_138", "inbound_nodes": [[["dropout_138", 0, 0, {}]]]}], "input_layers": [["input_139", 0, 0]], "output_layers": [["dense_138", 0, 0]]}}, "10": {"trial_id": "10", "val_loss": 0.2949616611003876, "val_accuracy": 0.8999999761581421, "model_config": {"name": "model_10", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "registered_name": null, "name": "input_11", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_10", "trainable": true, "dtype": "float32", "factor": [-0.16565594571071973, 0.16565594571071973], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_10", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_10", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_10", "inbound_nodes": [[["random_brightness_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_10", "trainable": true, "dtype": "float32", "height_factor": 0.0001225650753476637, "width_factor": 0.0001225650753476637, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_10", "inbound_nodes": [[["random_flip_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_10", "trainable": true, "dtype": "float32", "stddev": 0.008225741437286254, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_10", "inbound_nodes": [[["random_translation_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "conv2d_19", "inbound_nodes": [[["gaussian_noise_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "dtype": "float32", "activation": "tanh"}, "registered_name": null, "name": "activation_27", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 253, 253, 32]}, "name": "conv2d_20", "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_28", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [16, 16], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 63, 63, 32]}, "name": "conv2d_21", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_29", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_8", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 24, 16]}, "name": "depthwise_conv2d_8", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_30", "inbound_nodes": [[["depthwise_conv2d_8", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_10", "inbound_nodes": [[["activation_30", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "dtype": "float32", "rate": 0.5151823078033876, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 400]}, "name": "dropout_10", "inbound_nodes": [[["flatten_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 400]}, "name": "dense_10", "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_10", 0, 0]]}}, "252": {"trial_id": "252", "val_loss": 0.46623337268829346, "val_accuracy": 0.9200000166893005, "model_config": {"name": "model_252", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_253"}, "registered_name": null, "name": "input_253", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "RandomBrightness", "config": {"name": "random_brightness_252", "trainable": true, "dtype": "float32", "factor": [-0.05541322974257096, 0.05541322974257096], "value_range": [0, 1.0], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_brightness_252", "inbound_nodes": [[["input_253", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomFlip", "config": {"name": "random_flip_252", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_flip_252", "inbound_nodes": [[["random_brightness_252", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "RandomTranslation", "config": {"name": "random_translation_252", "trainable": true, "dtype": "float32", "height_factor": 0.020414139061418625, "width_factor": 0.020414139061418625, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "random_translation_252", "inbound_nodes": [[["random_flip_252", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_252", "trainable": true, "dtype": "float32", "stddev": 0.0031759920773399585, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "gaussian_noise_252", "inbound_nodes": [[["random_translation_252", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_626", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "conv2d_626", "inbound_nodes": [[["gaussian_noise_252", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_788", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_788", "inbound_nodes": [[["conv2d_626", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_627", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 127, 8]}, "name": "conv2d_627", "inbound_nodes": [[["activation_788", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_789", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_789", "inbound_nodes": [[["conv2d_627", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_628", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [8, 8], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 123, 123, 16]}, "name": "conv2d_628", "inbound_nodes": [[["activation_789", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_790", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "name": "activation_790", "inbound_nodes": [[["conv2d_628", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_162", "trainable": true, "dtype": "float32", "kernel_size": [16, 16], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 116, 116, 24]}, "name": "depthwise_conv2d_162", "inbound_nodes": [[["activation_790", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_791", "trainable": true, "dtype": "float32", "activation": "linear"}, "registered_name": null, "name": "activation_791", "inbound_nodes": [[["depthwise_conv2d_162", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_252", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "name": "flatten_252", "inbound_nodes": [[["activation_791", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_252", "trainable": true, "dtype": "float32", "rate": 0.33360108593051596, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 16224]}, "name": "dropout_252", "inbound_nodes": [[["flatten_252", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_252", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 