[
    {
        "trial_id": "57",
        "train_loss": 0.27685171365737915,
        "train_accuracy": 0.918749988079071,
        "val_loss": 0.3619767129421234,
        "val_accuracy": 0.9200000166893005,
        "num_params": 655493.0,
        "dense_num_params": 655365.0,
        "model_config": {
            "name": "model_57",
            "trainable": true,
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            256,
                            256,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_58"
                    },
                    "registered_name": null,
                    "name": "input_58",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomBrightness",
                    "config": {
                        "name": "random_brightness_57",
                        "trainable": true,
                        "dtype": "float32",
                        "factor": [
                            -0.07158602931141683,
                            0.07158602931141683
                        ],
                        "value_range": [
                            0,
                            1.0
                        ],
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_brightness_57",
                    "inbound_nodes": [
                        [
                            [
                                "input_58",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomFlip",
                    "config": {
                        "name": "random_flip_57",
                        "trainable": true,
                        "dtype": "float32",
                        "mode": "horizontal_and_vertical",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_flip_57",
                    "inbound_nodes": [
                        [
                            [
                                "random_brightness_57",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomTranslation",
                    "config": {
                        "name": "random_translation_57",
                        "trainable": true,
                        "dtype": "float32",
                        "height_factor": 0.024129128783027004,
                        "width_factor": 0.024129128783027004,
                        "fill_mode": "reflect",
                        "fill_value": 0.0,
                        "interpolation": "bilinear",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_translation_57",
                    "inbound_nodes": [
                        [
                            [
                                "random_flip_57",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "GaussianNoise",
                    "config": {
                        "name": "gaussian_noise_57",
                        "trainable": true,
                        "dtype": "float32",
                        "stddev": 0.006828120227342516,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "gaussian_noise_57",
                    "inbound_nodes": [
                        [
                            [
                                "random_translation_57",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_66",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                            1,
                            1
                        ],
                        "strides": [
                            4,
                            4
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "conv2d_66",
                    "inbound_nodes": [
                        [
                            [
                                "gaussian_noise_57",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_84",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "relu"
                    },
                    "registered_name": null,
                    "name": "activation_84",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_66",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_57",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    },
                    "registered_name": null,
                    "name": "flatten_57",
                    "inbound_nodes": [
                        [
                            [
                                "activation_84",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_57",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.3628795123224578,
                        "noise_shape": null,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            131072
                        ]
                    },
                    "name": "dropout_57",
                    "inbound_nodes": [
                        [
                            [
                                "flatten_57",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_57",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 5,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            131072
                        ]
                    },
                    "name": "dense_57",
                    "inbound_nodes": [
                        [
                            [
                                "dropout_57",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_58",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_57",
                    0,
                    0
                ]
            ]
        }
    },
    {
        "trial_id": "61",
        "train_loss": 0.24649326503276825,
        "train_accuracy": 0.918749988079071,
        "val_loss": 0.38881561160087585,
        "val_accuracy": 0.9200000166893005,
        "num_params": 1183493.0,
        "dense_num_params": 1183365.0,
        "model_config": {
            "name": "model_61",
            "trainable": true,
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            256,
                            256,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_62"
                    },
                    "registered_name": null,
                    "name": "input_62",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomBrightness",
                    "config": {
                        "name": "random_brightness_61",
                        "trainable": true,
                        "dtype": "float32",
                        "factor": [
                            -0.061698102833626874,
                            0.061698102833626874
                        ],
                        "value_range": [
                            0,
                            1.0
                        ],
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_brightness_61",
                    "inbound_nodes": [
                        [
                            [
                                "input_62",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomFlip",
                    "config": {
                        "name": "random_flip_61",
                        "trainable": true,
                        "dtype": "float32",
                        "mode": "horizontal_and_vertical",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_flip_61",
                    "inbound_nodes": [
                        [
                            [
                                "random_brightness_61",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomTranslation",
                    "config": {
                        "name": "random_translation_61",
                        "trainable": true,
                        "dtype": "float32",
                        "height_factor": 0.01912673120920108,
                        "width_factor": 0.01912673120920108,
                        "fill_mode": "reflect",
                        "fill_value": 0.0,
                        "interpolation": "bilinear",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_translation_61",
                    "inbound_nodes": [
                        [
                            [
                                "random_flip_61",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "GaussianNoise",
                    "config": {
                        "name": "gaussian_noise_61",
                        "trainable": true,
                        "dtype": "float32",
                        "stddev": 0.02104727096119923,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "gaussian_noise_61",
                    "inbound_nodes": [
                        [
                            [
                                "random_translation_61",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_70",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                            1,
                            1
                        ],
                        "strides": [
                            3,
                            3
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "conv2d_70",
                    "inbound_nodes": [
                        [
                            [
                                "gaussian_noise_61",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_88",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "relu"
                    },
                    "registered_name": null,
                    "name": "activation_88",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_70",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_61",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    },
                    "registered_name": null,
                    "name": "flatten_61",
                    "inbound_nodes": [
                        [
                            [
                                "activation_88",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_61",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.3772430204376923,
                        "noise_shape": null,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            236672
                        ]
                    },
                    "name": "dropout_61",
                    "inbound_nodes": [
                        [
                            [
                                "flatten_61",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_61",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 5,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            236672
                        ]
                    },
                    "name": "dense_61",
                    "inbound_nodes": [
                        [
                            [
                                "dropout_61",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_62",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_61",
                    0,
                    0
                ]
            ]
        }
    },
    {
        "trial_id": "259",
        "train_loss": 0.13003863394260406,
        "train_accuracy": 0.971875011920929,
        "val_loss": 0.4040206968784332,
        "val_accuracy": 0.9200000166893005,
        "num_params": 1183493.0,
        "dense_num_params": 1183365.0,
        "model_config": {
            "name": "model_259",
            "trainable": true,
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            256,
                            256,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_260"
                    },
                    "registered_name": null,
                    "name": "input_260",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomBrightness",
                    "config": {
                        "name": "random_brightness_259",
                        "trainable": true,
                        "dtype": "float32",
                        "factor": [
                            -0.021276748768744826,
                            0.021276748768744826
                        ],
                        "value_range": [
                            0,
                            1.0
                        ],
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_brightness_259",
                    "inbound_nodes": [
                        [
                            [
                                "input_260",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomFlip",
                    "config": {
                        "name": "random_flip_259",
                        "trainable": true,
                        "dtype": "float32",
                        "mode": "horizontal_and_vertical",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_flip_259",
                    "inbound_nodes": [
                        [
                            [
                                "random_brightness_259",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomTranslation",
                    "config": {
                        "name": "random_translation_259",
                        "trainable": true,
                        "dtype": "float32",
                        "height_factor": 0.012112247413311801,
                        "width_factor": 0.012112247413311801,
                        "fill_mode": "reflect",
                        "fill_value": 0.0,
                        "interpolation": "bilinear",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_translation_259",
                    "inbound_nodes": [
                        [
                            [
                                "random_flip_259",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "GaussianNoise",
                    "config": {
                        "name": "gaussian_noise_259",
                        "trainable": true,
                        "dtype": "float32",
                        "stddev": 0.0001723292335899006,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "gaussian_noise_259",
                    "inbound_nodes": [
                        [
                            [
                                "random_translation_259",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_276",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                            1,
                            1
                        ],
                        "strides": [
                            3,
                            3
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "conv2d_276",
                    "inbound_nodes": [
                        [
                            [
                                "gaussian_noise_259",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_308",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "relu"
                    },
                    "registered_name": null,
                    "name": "activation_308",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_276",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_259",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    },
                    "registered_name": null,
                    "name": "flatten_259",
                    "inbound_nodes": [
                        [
                            [
                                "activation_308",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_259",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.3195022429153345,
                        "noise_shape": null,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            236672
                        ]
                    },
                    "name": "dropout_259",
                    "inbound_nodes": [
                        [
                            [
                                "flatten_259",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_259",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 5,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            236672
                        ]
                    },
                    "name": "dense_259",
                    "inbound_nodes": [
                        [
                            [
                                "dropout_259",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_260",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_259",
                    0,
                    0
                ]
            ]
        }
    },
    {
        "trial_id": "247",
        "train_loss": 0.17228159308433533,
        "train_accuracy": 0.953125,
        "val_loss": 0.3220078945159912,
        "val_accuracy": 0.9200000166893005,
        "num_params": 1183493.0,
        "dense_num_params": 1183365.0,
        "model_config": {
            "name": "model_247",
            "trainable": true,
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            256,
                            256,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_248"
                    },
                    "registered_name": null,
                    "name": "input_248",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomBrightness",
                    "config": {
                        "name": "random_brightness_247",
                        "trainable": true,
                        "dtype": "float32",
                        "factor": [
                            -0.01624986935955862,
                            0.01624986935955862
                        ],
                        "value_range": [
                            0,
                            1.0
                        ],
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_brightness_247",
                    "inbound_nodes": [
                        [
                            [
                                "input_248",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomFlip",
                    "config": {
                        "name": "random_flip_247",
                        "trainable": true,
                        "dtype": "float32",
                        "mode": "horizontal_and_vertical",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_flip_247",
                    "inbound_nodes": [
                        [
                            [
                                "random_brightness_247",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomTranslation",
                    "config": {
                        "name": "random_translation_247",
                        "trainable": true,
                        "dtype": "float32",
                        "height_factor": 0.02759633409483236,
                        "width_factor": 0.02759633409483236,
                        "fill_mode": "reflect",
                        "fill_value": 0.0,
                        "interpolation": "bilinear",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_translation_247",
                    "inbound_nodes": [
                        [
                            [
                                "random_flip_247",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "GaussianNoise",
                    "config": {
                        "name": "gaussian_noise_247",
                        "trainable": true,
                        "dtype": "float32",
                        "stddev": 0.004003259623781206,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "gaussian_noise_247",
                    "inbound_nodes": [
                        [
                            [
                                "random_translation_247",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_263",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                            1,
                            1
                        ],
                        "strides": [
                            3,
                            3
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "conv2d_263",
                    "inbound_nodes": [
                        [
                            [
                                "gaussian_noise_247",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_295",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "relu"
                    },
                    "registered_name": null,
                    "name": "activation_295",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_263",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_247",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    },
                    "registered_name": null,
                    "name": "flatten_247",
                    "inbound_nodes": [
