[
    {
        "trial_id": "208",
        "train_loss": 0.23682621121406555,
        "train_accuracy": 0.9203125238418579,
        "val_loss": 0.3631797134876251,
        "val_accuracy": 0.9200000166893005,
        "num_params": 22404.0,
        "dense_num_params": 20255.0,
        "model_config": {
            "name": "model_208",
            "trainable": true,
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            256,
                            256,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_209"
                    },
                    "registered_name": null,
                    "name": "input_209",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomBrightness",
                    "config": {
                        "name": "random_brightness_208",
                        "trainable": true,
                        "dtype": "float32",
                        "factor": [
                            -0.1607442176598537,
                            0.1607442176598537
                        ],
                        "value_range": [
                            0,
                            1.0
                        ],
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_brightness_208",
                    "inbound_nodes": [
                        [
                            [
                                "input_209",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomFlip",
                    "config": {
                        "name": "random_flip_208",
                        "trainable": true,
                        "dtype": "float32",
                        "mode": "horizontal_and_vertical",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_flip_208",
                    "inbound_nodes": [
                        [
                            [
                                "random_brightness_208",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomTranslation",
                    "config": {
                        "name": "random_translation_208",
                        "trainable": true,
                        "dtype": "float32",
                        "height_factor": 0.19636024359114343,
                        "width_factor": 0.19636024359114343,
                        "fill_mode": "reflect",
                        "fill_value": 0.0,
                        "interpolation": "bilinear",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_translation_208",
                    "inbound_nodes": [
                        [
                            [
                                "random_flip_208",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "GaussianNoise",
                    "config": {
                        "name": "gaussian_noise_208",
                        "trainable": true,
                        "dtype": "float32",
                        "stddev": 0.003302701539075241,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "gaussian_noise_208",
                    "inbound_nodes": [
                        [
                            [
                                "random_translation_208",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "DepthwiseConv2D",
                    "config": {
                        "name": "depthwise_conv2d_160",
                        "trainable": true,
                        "dtype": "float32",
                        "kernel_size": [
                            4,
                            4
                        ],
                        "strides": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "depth_multiplier": 1,
                        "depthwise_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "depthwise_regularizer": null,
                        "depthwise_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "depthwise_conv2d_160",
                    "inbound_nodes": [
                        [
                            [
                                "gaussian_noise_208",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_576",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "linear"
                    },
                    "registered_name": null,
                    "name": "activation_576",
                    "inbound_nodes": [
                        [
                            [
                                "depthwise_conv2d_160",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_624",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 20,
                        "kernel_size": [
                            5,
                            5
                        ],
                        "strides": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            127,
                            127,
                            3
                        ]
                    },
                    "name": "conv2d_624",
                    "inbound_nodes": [
                        [
                            [
                                "activation_576",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_577",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "tanh"
                    },
                    "registered_name": null,
                    "name": "activation_577",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_624",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "DepthwiseConv2D",
                    "config": {
                        "name": "depthwise_conv2d_161",
                        "trainable": true,
                        "dtype": "float32",
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            4,
                            4
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "depth_multiplier": 1,
                        "depthwise_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "depthwise_regularizer": null,
                        "depthwise_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            62,
                            62,
                            20
                        ]
                    },
                    "name": "depthwise_conv2d_161",
                    "inbound_nodes": [
                        [
                            [
                                "activation_577",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_578",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "relu"
                    },
                    "registered_name": null,
                    "name": "activation_578",
                    "inbound_nodes": [
                        [
                            [
                                "depthwise_conv2d_161",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_625",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 18,
                        "kernel_size": [
                            1,
                            1
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            15,
                            15,
                            20
                        ]
                    },
                    "name": "conv2d_625",
                    "inbound_nodes": [
                        [
                            [
                                "activation_578",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_208",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    },
                    "registered_name": null,
                    "name": "flatten_208",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_625",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_208",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.5021462317629338,
                        "noise_shape": null,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4050
                        ]
                    },
                    "name": "dropout_208",
                    "inbound_nodes": [
                        [
                            [
                                "flatten_208",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_208",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 5,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4050
                        ]
                    },
                    "name": "dense_208",
                    "inbound_nodes": [
                        [
                            [
                                "dropout_208",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_209",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_208",
                    0,
                    0
                ]
            ]
        }
    },
    {
        "trial_id": "271",
        "train_loss": 0.155512735247612,
        "train_accuracy": 0.9546874761581421,
        "val_loss": 0.24393372237682343,
        "val_accuracy": 0.9399999976158142,
        "num_params": 23267.0,
        "dense_num_params": 20005.0,
        "model_config": {
            "name": "model_271",
            "trainable": true,
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            256,
                            256,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_272"
                    },
                    "registered_name": null,
                    "name": "input_272",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomBrightness",
                    "config": {
                        "name": "random_brightness_271",
                        "trainable": true,
                        "dtype": "float32",
                        "factor": [
                            -0.09996315610633416,
                            0.09996315610633416
                        ],
                        "value_range": [
                            0,
                            1.0
                        ],
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_brightness_271",
                    "inbound_nodes": [
                        [
                            [
                                "input_272",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomFlip",
                    "config": {
                        "name": "random_flip_271",
                        "trainable": true,
                        "dtype": "float32",
                        "mode": "horizontal_and_vertical",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_flip_271",
                    "inbound_nodes": [
                        [
                            [
                                "random_brightness_271",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomTranslation",
                    "config": {
                        "name": "random_translation_271",
                        "trainable": true,
                        "dtype": "float32",
                        "height_factor": 0.19617473556204265,
                        "width_factor": 0.19617473556204265,
                        "fill_mode": "reflect",
                        "fill_value": 0.0,
                        "interpolation": "bilinear",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_translation_271",
                    "inbound_nodes": [
                        [
                            [
                                "random_flip_271",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "GaussianNoise",
                    "config": {
                        "name": "gaussian_noise_271",
                        "trainable": true,
                        "dtype": "float32",
                        "stddev": 0.01102385121252139,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "gaussian_noise_271",
                    "inbound_nodes": [
                        [
                            [
                                "random_translation_271",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "DepthwiseConv2D",
                    "config": {
                        "name": "depthwise_conv2d_220",
                        "trainable": true,
                        "dtype": "float32",
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            3,
                            3
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "depth_multiplier": 1,
                        "depthwise_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "depthwise_regularizer": null,
                        "depthwise_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "depthwise_conv2d_220",
                    "inbound_nodes": [
                        [
                            [
                                "gaussian_noise_271",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_759",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "tanh"
                    },
                    "registered_name": null,
                    "name": "activation_759",
                    "inbound_nodes": [
                        [
                            [
                                "depthwise_conv2d_220",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_810",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 24,
                        "kernel_size": [
                            5,
                            5
                        ],
                        "strides": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            85,
                            85,
                            3
                        ]
                    },
                    "name": "conv2d_810",
                    "inbound_nodes": [
                        [
                            [
                                "activation_759",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_760",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "tanh"
                    },
                    "registered_name": null,
                    "name": "activation_760",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_810",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "DepthwiseConv2D",
                    "config": {
                        "name": "depthwise_conv2d_221",
                        "trainable": true,
                        "dtype": "float32",
                        "kernel_size": [
                            4,
                            4
                        ],
                        "strides": [
                            4,
                            4
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "depth_multiplier": 1,
                        "depthwise_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "depthwise_regularizer": null,
                        "depthwise_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            41,
                            41,
                            24
                        ]
                    },
                    "name": "depthwise_conv2d_221",
                    "inbound_nodes": [
                        [
                            [
                                "activation_760",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Activation",
                    "config": {
                        "name": "activation_761",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "relu"
                    },
                    "registered_name": null,
                    "name": "activation_761",
                    "inbound_nodes": [
                        [
                            [
                                "depthwise_conv2d_221",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_811",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 40,
                        "kernel_size": [
                            1,
                            1
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            10,
                            10,
                            24
                        ]
                    },
                    "name": "conv2d_811",
                    "inbound_nodes": [
                        [
                            [
                                "activation_761",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_271",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    },
                    "registered_name": null,
                    "name": "flatten_271",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_811",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_271",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.5399028383463549,
                        "noise_shape": null,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4000
                        ]
                    },
                    "name": "dropout_271",
                    "inbound_nodes": [
                        [
                            [
                                "flatten_271",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_271",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 5,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            4000
                        ]
                    },
                    "name": "dense_271",
                    "inbound_nodes": [
                        [
                            [
                                "dropout_271",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_272",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_271",
                    0,
                    0
                ]
            ]
        }
    },
    {
        "trial_id": "226",
        "train_loss": 0.15911433100700378,
        "train_accuracy": 0.948437511920929,
        "val_loss": 0.19066886603832245,
        "val_accuracy": 0.9599999785423279,
        "num_params": 25537.0,
        "dense_num_params": 20255.0,
        "model_config": {
            "name": "model_226",
            "trainable": true,
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            256,
                            256,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_227"
                    },
                    "registered_name": null,
                    "name": "input_227",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomBrightness",
                    "config": {
                        "name": "random_brightness_226",
                        "trainable": true,
                        "dtype": "float32",
                        "factor": [
                            -0.1586372786600971,
                            0.1586372786600971
                        ],
                        "value_range": [
                            0,
                            1.0
                        ],
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_brightness_226",
                    "inbound_nodes": [
                        [
                            [
                                "input_227",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomFlip",
                    "config": {
                        "name": "random_flip_226",
                        "trainable": true,
                        "dtype": "float32",
                        "mode": "horizontal_and_vertical",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_flip_226",
                    "inbound_nodes": [
                        [
                            [
                                "random_brightness_226",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "RandomTranslation",
                    "config": {
                        "name": "random_translation_226",
                        "trainable": true,
                        "dtype": "float32",
                        "height_factor": 0.19991190163443767,
                        "width_factor": 0.19991190163443767,
                        "fill_mode": "reflect",
                        "fill_value": 0.0,
                        "interpolation": "bilinear",
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            256,
                            256,
                            3
                        ]
                    },
                    "name": "random_translation_226",
                    "inbound_nodes": [
                        [
                            [
